[
  {
    "_id": "873dddf8-12b0-487f-9913-ff77b10d6e03",
    "topic_id": "35ada9dc-c24c-480e-bfdd-1d41f00e8559",
    "title": "Skriveni svet u The Witcher 3: Wild Hunt naslovu koji nismo smeli da vidimo!",
    "featuredImage": "http://localhost:3000/blogs/featured/1721638009222-835648063.jpeg",
    "content": [
      {
        "_id": 0,
        "key": "text",
        "value": [
          "Gotovo deset godina nakon što je igra The Witcher 3: Wild Hunt prvi put ugledala svetlost dana, fanovi su ostali zapanjeni otkrićem novog skrivenog sveta unutar igre, sveta za koji se čini da developeri nisu želeli da ga vidimo. Ova igra, razvijena od strane CD Projekt RED-a, originalno je lansirana 2015. godine za PC, PlayStation 4 i Xbox One, pre nego što je četiri godine kasnije čarobno portovana na Nintendo Switch konzole."
        ]
      },
      {
        "_id": 1,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721638009261-152513844.jpeg",
          "http://localhost:3000/blogs/galleries/1721638009261-585557493.jpeg",
          "http://localhost:3000/blogs/galleries/1721638009261-268023963.webp"
        ]
      },
      {
        "_id": 2,
        "key": "heading",
        "value": [
          "Sta nas ocekuje?"
        ]
      },
      {
        "_id": 3,
        "key": "text",
        "value": [
          "U The Witcher 3: Wild Hunt naslovu, igrač preuzima ulogu Geralta od Rivije, plaćenog lovca na čudovišta. Igra se odvija na ratom razorenom kontinentu punom čudovišta, gde je Geraltov zadatak da pronađe Ciri, dete proročanstva, živo oružje koje može promeniti sudbinu sveta. Ova igra je poznata po svojoj imerzivnoj priči, bogatom otvorenom svetu, epskim sporednim misijama, zanimljivim NPC-jevima i smrtonosnim čudovištima. Nedavno je korisnik Reddit-a otkrio skriveni svet u igri dok je slobodno istraživao kao Ciri izvan granica Velen sveta. Kako navodi, prilikom istraživanja, naišao je na zonu gde nebo postaje crveno, a drveće crno. U ovoj zoni nema predmeta za plen, ali je moguće istražiti svaki njen kutak nakon što se pronađe način da se pređe nevidljivi zid blizu severoistočne strane. Ovaj skriveni svet je otkriven tokom misije \"Ciri’s Story: Out of The Shadows\". Tokom ove misije, postoji trenutak kada Ciri može da se popne preko tornja, što izaziva glitch koji omogućava slobodno istraživanje. Pošto igrači ne bi trebalo da igraju kao Ciri na ovaj način u tom delu igre, ona nije ograničena granicama sveta, što joj omogućava da ide bilo gde dok ne padne kroz mapu."
        ]
      },
      {
        "_id": 4,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1721638009257-34437510.jpeg"
        ]
      },
      {
        "_id": 5,
        "key": "heading",
        "value": [
          "Da li ce biti iznenadjenja?"
        ]
      },
      {
        "_id": 6,
        "key": "text",
        "value": [
          "Ovo otkriće je uzbudljivo za dugogodišnje fanove igre, jer pokazuje koliko je svet The Witcher 3 igre bogat skrivenim tajnama i detaljima koje developeri možda nisu planirali da budu otkriveni. Ovaj tajni svet dodaje još jedan sloj misterije i intrige igri koja je već poznata po svojim dubokim narativima i detaljno izrađenim svetovima. The Witcher 3: Wild Hunt je igra koja nastavlja da fascinira i inspiriše svoje fanove skoro deceniju nakon originalnog izdanja. Otkrivanje skrivenih svetova i tajni pokazuje koliko je pažnje posvećeno detaljima u ovoj igri. Ako si ljubitelj The Witcher serijala ili tek planiraš da istražiš ovaj fantastični svet, sada je savršen trenutak da se ponovo uputiš u avanturu i možda sam otkriješ neke od mnogih tajni koje čekaju da budu pronađene."
        ]
      },
      {
        "_id": 7,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721638009255-106492956.jpeg",
          "http://localhost:3000/blogs/galleries/1721638009304-564617307.jpeg",
          "http://localhost:3000/blogs/galleries/1721638009323-151268118.webp"
        ]
      },
      {
        "_id": 8,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1721638009259-963811385.jpeg"
        ]
      }
    ],
    "published": true,
    "date": "Mon Jul 22 2024 10:46:49 GMT+0200 (Central European Summer Time)",
    "comments": []
  },
  {
    "_id": "89b2cf9a-4582-4885-8cbc-7551254d99cf",
    "topic_id": "35ada9dc-c24c-480e-bfdd-1d41f00e8559",
    "title": "Stariji Assassin's Creed naslovi dobijaju remake!",
    "featuredImage": "http://localhost:3000/blogs/featured/1721640144796-709912675.jpeg",
    "content": [
      {
        "_id": 0,
        "key": "text",
        "value": [
          "Ubisoft planira da obnovi starije naslove iz serijala, prilagođavajući ih modernim standardima sa unapređenom grafikom i poboljšanjima za najnovije konzole i PC-jeve. Ova inicijativa će omogućiti igračima da ponovo uživaju u klasičnim Assassin’s Creed igrama, ali sa osveženim vizualnim i tehničkim aspektima."
        ]
      },
      {
        "_id": 1,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721640144844-625189976.jpeg",
          "http://localhost:3000/blogs/galleries/1721640144892-654663070.jpeg",
          "http://localhost:3000/blogs/galleries/1721640144928-963447222.webp"
        ]
      },
      {
        "_id": 2,
        "key": "heading",
        "value": [
          "O cemu je rec?"
        ]
      },
      {
        "_id": 3,
        "key": "text",
        "value": [
          "Izvršni direktor Ubisoft-a, Yves Guillemot, u nedavnom intervjuu je naglasio da kompanija planira češća izdanja Assassin’s Creed igara, ali svaki put sa svežim iskustvom za igrače. Ova strategija ima za cilj da održi interesovanje fanova i privuče nove igrače, dok istovremeno čuva bogatstvo i dubinu sveta koji je stvoren u ranijim delovima franšize. Jedan od najavljenih naslova je Assassin’s Creed Hexe, koji će istraživati suđenja vešticama u svetom Rimskom carstvu. Ova igra obećava potpuno drugačije iskustvo u poređenju sa prethodnim delovima, donoseći novu atmosferu i narativ u serijal. Pored toga, Assassin’s Creed Shadows, smešten u Japanu tokom kraja Sengoku perioda, prikazaće stvarne istorijske događaje i ličnosti, uključujući poznatog feudalnog gospodara Odu Nobunagu. Shadows je zakazan za nam stiže 15. novembra i već izaziva veliko interesovanje među fanovima."
        ]
      },
      {
        "_id": 4,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1721640144848-576978189.jpeg"
        ]
      },
      {
        "_id": 5,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721640144927-637517284.webp",
          "http://localhost:3000/blogs/galleries/1721640144927-273877056.jpeg",
          "http://localhost:3000/blogs/galleries/1721640145197-246636149.webp"
        ]
      },
      {
        "_id": 6,
        "key": "heading",
        "value": [
          "Da li nas cekaju iznenadjenja?"
        ]
      },
      {
        "_id": 7,
        "key": "text",
        "value": [
          "Guillemot je najavio da će Ubisoft obnoviti starije Assassin’s Creed naslove, prilagođavajući ih modernoj eri igranja. Ovo podrazumeva unapređenu grafiku i tehnička poboljšanja koja će iskoristiti potencijal najnovijih konzola i moćnih PC-jeva. Cilj je da se stariji naslovi osveže kako bi i dalje bili relevantni i privlačni novim generacijama igrača. Iako nije precizirano koje igre će biti osvežene, izveštaji sugerišu da je u izradi nova verzija Assassin’s Creed IV: Black Flag. Ovaj naslov, koji je izašao 2013. godine, fokusiran na pirate iz 18. veka, ostaje jedan od omiljenih među fanovima serijala. Black Flag je bio revolucionaran u svoje vreme, donoseći otvoreni svet istraživanja mora i borbe na brodovima, i njegova obnova će sigurno doneti novi talas oduševljenja među igračima. Ubisoft se takođe priprema za lansiranje nove platforme pod nazivom “Animus Hub” zajedno sa izlaskom Shadows-a. Ovaj hub, ranije poznat kao Infinity, omogućiće igračima da pristupe i igraju sve igre iz franšize na jednom mestu. Animus Hub će verovatno služiti i kao prodavnica, gde će igrači moći da kupe stare i nove naslove."
        ]
      },
      {
        "_id": 8,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721640145193-738117032.jpeg",
          "http://localhost:3000/blogs/galleries/1721640145194-755875776.webp",
          "http://localhost:3000/blogs/galleries/1721640145196-31156239.webp"
        ]
      },
      {
        "_id": 9,
        "key": "heading",
        "value": [
          "Kakva su ocekivanja fanova?"
        ]
      },
      {
        "_id": 10,
        "key": "text",
        "value": [
          "Ako Ubisoft planira da razvije više Assassin’s Creed naslova za ovu platformu, to bi bio strateški smislen potez. Razvijanjem i osvežavanjem starijih igara, kompanija može privući nove igrače, dok istovremeno održava interesovanje među dugogodišnjim fanovima. Animus Hub će omogućiti igračima da imaju sve svoje omiljene Assassin’s Creed igre na dohvat ruke, što je značajan korak napred u povezivanju cele franšize. Ubisoft-ova odluka da obnovi starije Assassin’s Creed naslove predstavlja uzbudljiv razvoj za franšizu. Sa unapređenom grafikom i tehničkim poboljšanjima, ove igre će dobiti novu šansu da zasijaju u modernoj eri igranja. Uz to, nova platforma Animus Hub će omogućiti igračima da lako pristupe svim igrama iz serijala na jednom mestu. Nadolazeći naslovi, poput Assassin’s Creed Hexe i Shadows, dodatno će obogatiti franšizu, donoseći sveža iskustva i nove istorijske periode za istraživanje. Ubisoft-ov strateški pristup obećava svetlu budućnost za Assassin’s Creed franšize i sigurno će oduševiti sve ljubitelje serijala."
        ]
      },
      {
        "_id": 11,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1721640144846-911306737.jpeg"
        ]
      },
      {
        "_id": 12,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721640145187-705416085.webp",
          "http://localhost:3000/blogs/galleries/1721640145187-147482324.jpeg",
          "http://localhost:3000/blogs/galleries/1721640145187-911528405.jpeg"
        ]
      }
    ],
    "published": true,
    "date": "Mon Jul 22 2024 11:22:24 GMT+0200 (Central European Summer Time)",
    "comments": []
  },
  {
    "_id": "8d81889f-3d72-4780-8ae8-8a09f3fa051b",
    "topic_id": "f27cf95d-54c2-4771-8daf-455800601d54",
    "title": "Novi čipset za Windows on ARM platformu!",
    "featuredImage": "http://localhost:3000/blogs/featured/1721640644694-556897994.webp",
    "content": [
      {
        "_id": 0,
        "key": "text",
        "value": [
          "U svetu procesora, kompanije poput Intel-a, Nvidie, AMD-a i Qualcomm-a su dobro poznate. Međutim, 2025. godine, jedna manje poznata kompanija, MediaTek, planira da se pridruži ovoj eliti sa svojim novim AI PC čipsetom."
        ]
      },
      {
        "_id": 1,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721640644725-42871893.jpeg",
          "http://localhost:3000/blogs/galleries/1721640644725-174911935.jpeg",
          "http://localhost:3000/blogs/galleries/1721640644725-686956708.png"
        ]
      },
      {
        "_id": 2,
        "key": "heading",
        "value": [
          "Kakve su novosti, sta nas ceka?"
        ]
      },
      {
        "_id": 3,
        "key": "text",
        "value": [
          "Prema poslednjim izveštajima, MediaTek trenutno radi na razvoju čipseta koji će biti lansiran krajem 2025. godine. Ovaj čipset će biti namenjen za Microsoft Copilot Plus PC program, što je inicijativa koju je Qualcomm pokrenuo sa Microsoft-om. Qualcomm Snapdragon X Elite je trenutno glavna tema na tržištu, a MediaTek želi deo tog tržišta. MediaTek vidi priliku u završetku ekskluzivnog ugovora između Microsoft-a i Qualcomm-a za Windows on ARM računare. Ovo otvara vrata ne samo MediaTek-u, već i drugim kompanijama poput Nvidie i AMD-a, koje takođe planiraju da ponude svoje ARM PC čipove 2025. godine. Zanimljivo je da postoji mogućnost da Nvidia koristi MediaTek-ovu asistenciju u dizajniranju i izradi specijalnog procesora. Prema izveštaju tajvanskih United Daily News, MediaTek pomaže Nvidiji u dizajniranju i izradi specijalnog procesora. Postoje čak i glasine da MediaTek i Nvidia možda rade na čipu za prenosne gejming konzole poput Steam Deck-a. Ovo partnerstvo može biti ključni korak za obe kompanije u osiguravanju svoje pozicije na tržištu ARM procesora."
        ]
      },
      {
        "_id": 4,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1725023136715-302459218.jpeg"
        ]
      },
      {
        "_id": 5,
        "key": "text",
        "value": [
          "Mediatek je „fabless“ proizvođač čipova, što znači da ne proizvodi čipove samostalno. Novi MediaTek čip će koristiti referentni Arm dizajn, što znači da će usvajati već dizajnirana procesorska jezgra kompanije Arm, umesto da razvija nešto potpuno novo. Ova strategija može ubrzati proces razvoja i omogućiti MediaTek-u da brže uđe na tržište. Tržište ARM procesora za Windows on ARM platformu postaje sve konkurentnije. Izvršni direktori Arm-a su izjavili da je jedan od njihovih kupaca koristio gotov dizajn kako bi napravio procesor za samo devet meseci. Ovaj brz razvoj može predstavljati ozbiljnu konkurenciju za Qualcomm, koji je do sada dominirao ovim tržištem. Sve veća konkurencija na tržištu ARM procesora može doneti brojne prednosti za korisnike. Povećana konkurencija obično dovodi do inovacija, boljih performansi i nižih cena. MediaTek-ov ulazak na ovo tržište može dodatno ubrzati ove procese, pružajući korisnicima više opcija i bolje performanse njihovih uređaja. MediaTek-ova odluka da se uključi u trku za Windows on ARM platformu pokazuje da kompanija ima ambiciozne planove za budućnost. Uz podršku Microsoft-a i moguće partnerstvo sa Nvidijom, MediaTek ima potencijal da postane značajan igrač na tržištu ARM procesora. Ova inovacija će doneti nove mogućnosti i izazove, kako za korisnike, tako i za konkurenciju. Kako se trka za dominaciju na tržištu Windows on ARM procesora zahuktava, MediaTek se pozicionira kao ozbiljan konkurent Qualcomm-u. Uz podršku Microsoft-a i moguće partnerstvo sa Nvidijom, MediaTek-ov ulazak na ovo tržište može doneti značajne promene i poboljšanja."
        ]
      }
    ],
    "published": true,
    "date": "Mon Jul 22 2024 11:30:44 GMT+0200 (Central European Summer Time)",
    "comments": []
  },
  {
    "_id": "e5279d82-b4e5-41fe-a6d9-283d9fe99068",
    "topic_id": "f27cf95d-54c2-4771-8daf-455800601d54",
    "title": "LG Display pokreće proizvodnju Tandem OLED ploča!!",
    "featuredImage": "http://localhost:3000/blogs/featured/1721640965386-989516523.webp",
    "content": [
      {
        "_id": 0,
        "key": "text",
        "value": [
          "LG Display je napravio značajan korak napred u svetu tehnologije ekrana, započevši proizvodnju prvih Tandem OLED panela za laptopove. Ova inovacija donosi brojne prednosti koje će značajno unaprediti korisničko iskustvo, pružajući bolje performanse i dugotrajnost."
        ]
      },
      {
        "_id": 1,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1721640965422-672661637.jpeg"
        ]
      },
      {
        "_id": 2,
        "key": "heading",
        "value": [
          "Kakve su novosti?"
        ]
      },
      {
        "_id": 3,
        "key": "text",
        "value": [
          "Tandem OLED tehnologija se razlikuje od tradicionalnih OLED panela po tome što koristi dva sloja crvenih, zelenih i plavih (RGB) emisionih slojeva, dok standardni OLED paneli koriste samo jedan emisioni sloj. Ovaj dodatni sloj omogućava panelu da pruži veću osvetljenost i duži životni vek, što ga čini idealnim za upotrebu u uređajima koji zahtevaju visok nivo izdržljivosti i performansi. LG Display je prvi put predstavio Tandem OLED tehnologiju 2019. godine, koristeći je u ekranima za automobile. Automobilski ekrani zahtevaju visoku izdržljivost i dugotrajnost, što je savršeno odgovaralo karakteristikama Tandem OLED panela. Sada, LG Display proširuje ovu tehnologiju i na tržište laptopova, pružajući korisnicima visoko kvalitetne ekrane sa superiornim performansama."
        ]
      },
      {
        "_id": 4,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1725023289070-208417080.png",
          "http://localhost:3000/blogs/galleries/1725023289074-256316947.png",
          "http://localhost:3000/blogs/galleries/1725023289085-981649241.png"
        ]
      },
      {
        "_id": 5,
        "key": "heading",
        "value": [
          "Kakvi su utisci i ocekivanja korisnika?"
        ]
      },
      {
        "_id": 6,
        "key": "text",
        "value": [
          "LG Display, zajedno sa drugim proizvođačima ekrana poput Samsung Display, aktivno radi na proširenju upotrebe OLED tehnologije izvan pametnih telefona. Cilj im je da osvoje nova tržišta, kao što su laptopovi i tableti, i da pruže vrhunske performanse i kvalitet prikaza u ovim uređajima. Apple je već primenio Tandem OLED tehnologiju u svojim najnovijim iPad Pro modelima, što pokazuje da postoji velika potražnja za ovim vrhunskim ekranima. Očekuje se da će Apple u budućnosti koristiti OLED panele i u svojim MacBook uređajima, što znači da će LG Display i Samsung Display imati ključnu ulogu kao glavni dobavljači. Uvođenje Tandem OLED panela u svet laptopova predstavlja značajan napredak u tehnologiji ekrana. Ova inovacija donosi brojne prednosti, uključujući veću osvetljenost, duži životni vek, manju potrošnju energije, tanji i lakši dizajn, kao i superioran kvalitet prikaza. LG Display je postavio novi standard u industriji ekrana, pružajući korisnicima vrhunske performanse i izuzetno vizuelno iskustvo. Ova tehnologija će imati veliki uticaj na buduće generacije laptopova i drugih uređaja, omogućavajući proizvođačima da kreiraju još bolja i efikasnija rešenja za svoje korisnike. Sa LG Display-om na čelu ove revolucije, budućnost OLED tehnologije izgleda izuzetno svetlo."
        ]
      },
      {
        "_id": 7,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1725023289073-92088851.jpeg"
        ]
      },
      {
        "_id": 8,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721640965498-319077292.jpeg",
          "http://localhost:3000/blogs/galleries/1721640965727-364502390.jpeg",
          "http://localhost:3000/blogs/galleries/1721640965727-963901168.jpeg"
        ]
      }
    ],
    "published": true,
    "date": "Mon Jul 22 2024 11:36:05 GMT+0200 (Central European Summer Time)",
    "comments": []
  },
  {
    "_id": "0991a86f-d2ab-48e6-86a7-67b18a0713a9",
    "topic_id": "35ada9dc-c24c-480e-bfdd-1d41f00e8559",
    "title": "Luigi's Mansion 2 HD - Povratak uplašenog isterivača duhova!",
    "featuredImage": "http://localhost:3000/blogs/featured/1721641206458-920061886.jpeg",
    "content": [
      {
        "_id": 0,
        "key": "text",
        "value": [
          "Luigi je izrastao u prepoznatljivog junaka sa sopstvenim serijalom igara. Njegova transformacija iz senke Mario-a u uplašenog isterivača duhova započela je još 2001. godine sa prvom igrom Luigi's Mansion na GameCube konzoli. Sada, sa dolaskom Luigi's Mansion 2 HD na Nintendo Switch konzole, možemo ponovo da uživamo u ovoj jedinstvenoj avanturi, ali u novom, lepšem okruženju."
        ]
      },
      {
        "_id": 1,
        "key": "heading",
        "value": [
          "Napredniji gameplay."
        ]
      },
      {
        "_id": 2,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721641206501-216250084.webp",
          "http://localhost:3000/blogs/galleries/1721641206848-879913981.jpeg",
          "http://localhost:3000/blogs/galleries/1721641206849-153788068.jpeg"
        ]
      },
      {
        "_id": 3,
        "key": "text",
        "value": [
          "Luigi's Mansion 2 HD je remaster verzija drugog nastavka koji je originalno bio poznat kao Luigi's Mansion: Dark Moon i bio je ekskluzivan za Nintendo 3DS konzole. Ovaj remaster donosi unapređene grafičke modele i vizuale koji odgovaraju modernim standardima Switch konzole, zadržavajući sve čari originala. Iako je stereoskopska 3D grafika izbačena, detaljniji modeli i poboljšani vizuali pružaju osveženo iskustvo koje će zadovoljiti i stare i nove fanove. Ovaj remaster nam je pružio savršenu priliku da zaronimo u svet uplašenog Luiđija. Odmah smo bili impresionirani kako igra uspeva da kombinuje creepy atmosferu sa humorom i šarmom koji su karakteristični za Nintendo igre. Luiđi je konačno dobio svoj zasluženi trenutak u centru pažnje i to je nešto što svaki ljubitelj Nintendo igara treba da doživi. Većina igre se odvija u ukletim kućama i drugim spooky lokacijama. Nivoi su dizajnirani tako da igračima nude relativno kratke zadatke, poput čišćenja soba od duhova ili pronalaženja određenih predmeta. Ova struktura je idealna za portable igranje, što čini Luigi's Mansion 2 HD savršenim za Switch. Pored toga, igra je prepuna zagonetki koje zahtevaju pažljivo istraživanje i logičko razmišljanje, što pruža dodatni nivo zadovoljstva kada konačno rešite zagonetku i otključate novu sobu."
        ]
      },
      {
        "_id": 4,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1721641206503-127783848.jpeg"
        ]
      },
      {
        "_id": 5,
        "key": "heading",
        "value": [
          "Sta nas ceka u ovom remake-u?"
        ]
      },
      {
        "_id": 6,
        "key": "text",
        "value": [
          "Luiđi koristi svoj usisivač, poznat kao Poltergust 5000, ne samo za hvatanje duhova, već i za interakciju sa okolinom. Ovaj element igre je izuzetno zabavan, jer omogućava igračima da istražuju svaku prostoriju i otkrivaju skrivene predmete i tajne. Usisavanje predmeta, izvlačenje tajnih vrata i borba protiv komičnih duhova su samo neki od načina na koje igra koristi Poltergust 5000. Takođe, igra nudi različite nadogradnje za Poltergust, što dodatno povećava njegovu korisnost i funkcionalnost. Jedan zanimljiv aspekt Luigi's Mansion 2 HD naslova je sličnost sa prvim Resident Evil igrama. Lutanje po kući, traženje predmeta koji rešavaju zagonetke i otključavanje novih prostorija podseća na stare škole japanskih igara. Ova zajednička inspiracija čini igru još privlačnijom za ljubitelje starih avantura. Naravno, Luigi's Mansion 2 HD je mnogo manje strašan i više usmeren ka porodičnoj publici, ali taj osećaj istraživanja i otkrivanja novih tajni je definitivno prisutan. Originalna verzija igre na 3DS-u imala je multiplayer mod, poznat kao ScareScraper, koji je takođe prebačen u HD remaster. Sa još tri igrača, možeš istraživati nasumično generisane kule i završavati zadatke u četiri različita online moda. Multiplayer mod je izuzetno zabavan, posebno kada igraš sa prijateljima. Iako Nintendo online igre obično nemaju voice chat, to ne umanjuje zabavu koju donosi zajedničko igranje. Nedostatak komunikacije može čak i doprineti komičnim situacijama kada se Luiđiji sudaraju ili panično trče po sobama."
        ]
      },
      {
        "_id": 7,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721641206497-576733363.jpeg",
          "http://localhost:3000/blogs/galleries/1721641206498-545360798.jpeg",
          "http://localhost:3000/blogs/galleries/1721641206626-93373144.webp"
        ]
      }
    ],
    "published": true,
    "date": "Mon Jul 22 2024 11:40:06 GMT+0200 (Central European Summer Time)",
    "comments": []
  },
  {
    "_id": "783180d2-b8af-46bd-a008-7b208325ebb6",
    "topic_id": "1f91446e-df0f-465a-b66c-54da792d3be3",
    "title": "Intel protiv Nvidia kompanije - Intel donosi novine sa Gaudi 3 AI akceleratorima!",
    "featuredImage": "http://localhost:3000/blogs/featured/1721641504628-692787703.jpeg",
    "content": [
      {
        "_id": 0,
        "key": "text",
        "value": [
          "Intel je napravio hrabar potez u borbi za dominaciju na tržištu AI hardvera. Na nedavnom Computex 2024 događaju, izvršni direktor Intel-a, Pat Gelsinger, predstavio je cene i performanse za novu generaciju Gaudi 2 i Gaudi 3 AI akceleratora. Ovaj potez je odmah privukao pažnju, jer Intel tvrdi da su njihove cene i performanse superiorne u poređenju sa konkurentnim Nvidia proizvodima."
        ]
      },
      {
        "_id": 1,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1725023240488-816582739.jpeg",
          "http://localhost:3000/blogs/galleries/1725023240493-489030041.jpeg",
          "http://localhost:3000/blogs/galleries/1725023240497-399128293.jpeg"
        ]
      },
      {
        "_id": 2,
        "key": "heading",
        "value": [
          "O cemu je rec?"
        ]
      },
      {
        "_id": 3,
        "key": "text",
        "value": [
          "Intel Gaudi 3 akcelerator obećava vrhunske performanse u raznim AI zadacima. Ovi čipovi su dizajnirani da budu konkurentni ne samo u pogledu cene, već i u pogledu brzine treniranja i inferencijskih sposobnosti. Prema Intel-u, Gaudi 3 drži korak ili nadmašuje Nvidia H100 u mnogim važnim AI scenarijima. Intel-ovi testovi pokazuju da Gaudi 3 pruža do 40% brže vreme treniranja od H100 u velikim klasterima od 8.192 čipa. Čak i manji setup sa 64 Gaudi 3 čipa nudi 15% veći protok od H100 na popularnom LLaMA 2 jezičkom modelu. U pogledu AI inferencije, Intel tvrdi da Gaudi 3 ima dvostruku prednost nad H100 na modelima kao što su LLaMA i Mistral. Jedna od ključnih prednosti Gaudi čipova je njihova upotreba otvorenih standarda kao što je Ethernet, što omogućava lakšu implementaciju. Međutim, nedostatak optimizacije za Nvidia-inu sveprisutnu CUDA platformu predstavlja izazov. Većina AI softvera danas se oslanja na CUDA, tako da će ubeđivanje preduzeća da refaktorišu svoj kod za Gaudi biti težak zadatak."
        ]
      },
      {
        "_id": 4,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1725023240485-889374594.jpeg"
        ]
      }
    ],
    "published": true,
    "date": "Mon Jul 22 2024 11:45:04 GMT+0200 (Central European Summer Time)",
    "comments": []
  },
  {
    "_id": "52f70836-c6bd-4c5e-8d46-b02a6300b622",
    "topic_id": "a2b295c5-7aa4-4009-b55a-7de99be1dd81",
    "title": "Najbolji laptopovi za rad, programiranje i gejming!",
    "featuredImage": "http://localhost:3000/blogs/featured/1721641777622-902883843.webp",
    "content": [
      {
        "_id": 0,
        "key": "text",
        "value": [
          "Dobrodošao u svet ASUS laptopova, gde snaga, elegancija i vrhunske performanse dolaze u savršenom spoju. Tema današnjeg bloga su najbolji laptopovi za rad, programiranje i nezaboravno gejming iskustvo. Pogledajmo pažljivije svaki odabrani model i istražimo šta ih čini posebnim."
        ]
      },
      {
        "_id": 1,
        "key": "heading",
        "value": [
          "Zasto je bitno izabrati novi laptop?"
        ]
      },
      {
        "_id": 2,
        "key": "text",
        "value": [
          "Izbor pravog laptopa za rad, programiranje ili gejming ima značajan uticaj na našu produktivnost i zadovoljstvo korisničkim iskustvom. Dobar laptop ne samo da olakšava svakodnevne zadatke već i omogućava brži rad, bezbednost podataka i neometano izvršavanje zahtevnih aplikacija. Kada je reč o programiranju, pouzdan laptop sa snažnim procesorom i dovoljno RAM-a može napraviti razliku između glatkog kodiranja i frustrirajućeg čekanja na učitavanje."
        ]
      },
      {
        "_id": 3,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1721641777658-658001482.jpeg",
          "http://localhost:3000/blogs/galleries/1721641777683-618637456.webp",
          "http://localhost:3000/blogs/galleries/1721641777855-933139865.jpeg"
        ]
      },
      {
        "_id": 4,
        "key": "heading",
        "value": [
          "ASUS ROG Strix G18 G814JI-N5095W gejmerski laptop - Monstrum među laptopovima"
        ]
      },
      {
        "_id": 5,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1721641777660-164778995.jpeg"
        ]
      },
      {
        "_id": 6,
        "key": "text",
        "value": [
          "ASUS ROG Strix G18 G814JI-N5095W laptop je prava vizuelna i tehnička poslastica. Sa ogromnim 18-inčnim FHD+ ekranom, pruža imerzivno iskustvo koje očarava. Intel i7-13650HX procesor garantuje munjevite performanse, dok NVIDIA GeForce RTX 4070 čip donosi visokokvalitetnu grafiku i podršku za ray tracing. Sa 16GB RAM-a i SSD-om od 1TB, ovaj laptop ima sve što je potrebno za glatko multitasking iskustvo. Dizajn ROG Strix G18 laptopa je pravo remek-delo, sa RGB osvetljenjem koje ne samo da privlači pažnju već i omogućava personalizaciju. Povezivanje sa drugim uređajima je lako zahvaljujući brojnim portovima, uključujući USB, HDMI i Mini DisplayPort."
        ]
      }
    ],
    "published": true,
    "date": "Mon Jul 22 2024 11:49:37 GMT+0200 (Central European Summer Time)",
    "comments": []
  },
  {
    "_id": "2579dd54-1cef-476b-ad08-a2a9b07a673e",
    "topic_id": "35ada9dc-c24c-480e-bfdd-1d41f00e8559",
    "title": "Monster Hunter Wilds - Nova era lovaca počinje!",
    "featuredImage": "http://localhost:3000/blogs/featured/1725020940966-104667727.jpeg",
    "content": [
      {
        "_id": 0,
        "key": "text",
        "value": [
          "Najnoviji trailer za Monster Hunter Wilds igru, koji je prikazan na Gamescomu 2024, otkriva potpuno novu lokaciju, likove i strašne nove zveri koje ćemo loviti. Igra smešta lovce u prelepu, ali smrtonosnu prirodu, a nova lokacija - Scarlet Forest - je posebno impresivna sa svojim krvavocrvenim vodama i bogatom vegetacijom. Nova zver koja vlada ovim područjem je Lala Barina, pripadnik retke vrste Temnoceran, čije se telo transformiše u smrtonosni cvet!"
        ]
      },
      {
        "_id": 1,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1725020941001-17695442.jpeg"
        ]
      },
      {
        "_id": 2,
        "key": "heading",
        "value": [
          "What can we expect?"
        ]
      },
      {
        "_id": 3,
        "key": "text",
        "value": [
          "Jedna od ključnih karakteristika igre je promenljiva priroda okruženja. Monster Hunter Wilds donosi jedinstveni ekosistem sa tri različite faze: Fallow, period smanjenih resursa i agresivnijih predatora; Inclemency, ekstremni vremenski uslovi koji menjaju ekosistem; Plenty, period obnove i bujanja života. Ovi dinamični uslovi garantuju da nijedan lov neće biti isti, pružajući igračima konstantan izazov. Svaka nova lokacija ima svog vladara - apex monstruma. Rey Dau, vrhovni predator Windward Plains područja, dominira okolinom tokom Sandtide Inclemency perioda. Ovaj leteći zmaj ne samo da kontroliše gromove, već može izazvati destruktivne udare munja tokom borbi, što će izazvati paniku među lovcima. Igrači će sada moći da lovu pristupe i solo uz pomoć novog Support Hunter sistema. Ovaj sistem omogućava pozivanje NPC lovaca da pomognu u borbi, čineći solo igranje dinamičnijim i izazovnijim. Uz ovu funkcionalnost, igrači mogu prilagoditi postavke SOS signalne rakete, odlučujući da li žele pomoć stvarnih igrača ili podršku NPC likova."
        ]
      },
      {
        "_id": 4,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1725020941027-346295679.jpeg",
          "http://localhost:3000/blogs/galleries/1725020941028-346752636.jpeg",
          "http://localhost:3000/blogs/galleries/1725020941028-169959327.jpeg"
        ]
      },
      {
        "_id": 5,
        "key": "image",
        "value": [
          "http://localhost:3000/blogs/singles/1725020941005-935909265.webp"
        ]
      },
      {
        "_id": 6,
        "key": "heading",
        "value": [
          "What about the gameplay?"
        ]
      },
      {
        "_id": 7,
        "key": "text",
        "value": [
          "Windward Plains baza služi kao centralno mesto za pripremu pre lova - od kupovine opreme do kuvanja hrane. Ovaj kamp, smešten na obalama Forbidden Lands, je središte istraživanja gde će lovci komunicirati sa članovima Research Commission-a, razmenjivati informacije i pripremati se za izazove koje ih čekaju. Jedno od novih naselja, Windsong Village - Kunafa, smešteno je u srcu Windward Plains. Ovo selo je poznato po svom siru i kulturi koja je oblikovana surovim uslovima okruženja. Interakcije između lovaca i stanovnika naselja obogaćuju igračko iskustvo, pružajući uvid u bogatu istoriju i običaje lokalnog stanovništva. Monster Hunter Wilds naslov uvodi nove mehanike koje proširuju klasično iskustvo lova. Lovci će moći da koriste Offset Attack, specifične napade oružjem koji omogućavaju povratni udarac nakon sudara sa napadom monstruma. Uz nove Portable BBQ Grill i Pop-up Camp funkcionalnosti, igrači mogu da kuvaju i jedu hranu bez povratka u glavni kamp, što im omogućava duže boravke u lovu bez prekida. Monster Hunter Wilds obećava da će doneti svežinu i uzbuđenje u serijal, kombinujući prepoznatljivu mehaniku sa novim elementima poput dinamičnih ekosistema, unikatnih monstruma i inovativnih načina lova. Igrači će moći da istražuju prelepe i smrtonosne predele, suoče se sa moćnim neprijateljima i koriste sve svoje veštine i opremu kako bi preživeli u ovom izazovnom svetu. Uz datum izlaska planiran za 2025. godinu na PlayStation 5 konzolama, Monster Hunter Wilds igra će sigurno biti jedna od najiščekivanijih igara godine."
        ]
      },
      {
        "_id": 8,
        "key": "gallery",
        "value": [
          "http://localhost:3000/blogs/galleries/1725020941036-100938608.jpeg",
          "http://localhost:3000/blogs/galleries/1725020941042-951778979.jpeg",
          "http://localhost:3000/blogs/galleries/1725020941044-469526478.jpeg"
        ]
      }
    ],
    "published": true,
    "date": "Fri Aug 30 2024 14:29:00 GMT+0200 (Central European Summer Time)",
    "comments": []
  }
]